feat: олная переработка системы и исправление ошибок
